Revit 2024 API
UIDocument.Application Property
 Retrieves an object that represents the current Application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public UIApplication Application { get; }
Visual Basic
Public ReadOnly Property Application As UIApplication
	Get
Visual C++
public:
property UIApplication^ Application {
	UIApplication^ get ();
}
See Also
UIDocument Class
Autodesk.Revit.UI Namespace